# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pcre2' # https://freek.dev/2151-fixing-the-dreaded-pcre2h-file-not-found-error-when-installing-imagick
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'nvm'

# Apps
cask '1password'
cask 'alfred'
cask 'brave-browser'
cask 'daisydisk'
cask 'dbngin'
cask 'docker'
cask 'fig'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'helo'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'

# Nord apps
cask 'nordlocker'
cask 'nordpass'
cask 'nordvpn'

cask 'pastebot'
cask 'phpmon'
cask 'phpstorm'
cask 'ray'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'tower'
cask 'rectangle'
cask 'transmit'
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'Todoist', id: 585829637
